export const visDis = {
  0: "0~0.1km",
  1: "0.45km",
  2: "0.75km",
  3: "1.0km",
  4: "3.0km",
  5: "4.3km",
  6: "4.9km",
  7: "13km",
  8: "25km",
  9: "36km~",
};

export const obsEx = {
  0: "目の前のマンションの識別も難しい",
  1: "Yazawa Deux Bldgが識別可能",
  2: "立川病院まで識別可能",
  3: "ラポール西国立まで識別可能",
  4: "一橋大学法人本部棟まで識別可能",
  5: "多摩総合医療センター(府中病院)まで識別可能",
  6: "ライオンズガーデン西国分寺まで識別可能",
  7: "グレーシアタワー三鷹まで識別可能",
  8: "新宿ビル群まで識別可能",
  9: "東京スカイツリーの識別が可能",
};

export const Fujiobs = {
  0: "×",
  1: "△",
  2: "〇",
};

export const fujiObsEx = {
  0: "見えない",
  1: "部分的に見える",
  2: "見える",
};

export const directionMap = {
  Zenith: "天頂",
  North: "北",
  East: "東",
  South: "南",
  West: "西",
};
